namespace Lesson4_封装_构造函数和析构函数
{
    #region 知识点一 构造函数
    //基本概念
    //在实例化对象时 会调用的用于初始化的函数
    //如果不写 默认存在一个无参构造函数

    //构造函数的写法
    //1 没有返回值
    //2 函数名必须和类名相同
    //3 没有特殊需求 一般都是public
    //4 构造函数可以被重载
    //5 this代表当前调用该函数的对象自己
    class Person
    {
        public string name;
        public int age;

        //类中允许自己声明无参构造函数，结构体不允许
        public Person()
        {
            name = "熊大";
            age = 18;
        }

        /*public Person(int age)
        {
            //this代表当前调用该函数的对象自己
            this.age = age;
        }*/
        public Person(string name, int age) : this()
        {
            Console.WriteLine("Person两个参数构造函数调用");
        }

        //当引用类型的堆内存被回收时调用
        //析构函数 是当垃圾 真正被回收的时候 才会调用
        ~Person()
        {

        }
    }

    //注意：
    // 如果不自己实现无参构造函数而实现了有参构造函数，会失去默认的无参构造
    #endregion

    #region 知识点二 构造函数的特殊写法
    //可以通过this 重用构造函数代码
    //访问修饰符 构造函数 (参数列表):this(参数1,参数2....)
    #endregion

    #region 知识点三 析构函数(了解)
    //基本概念
    //当引用类型的堆内存被回收时，会调用该函数
    //对于需要手动管理内存的语言（C++），需要在析构函数中做一些内存回收处理
    //但是C#中存在自动立即回收处理机制GC
    //所以几乎不会使用析构函数，除非想在某一个对象被垃圾回收时，做一些特殊处理

    //基本语法
    //  ~类名()
    // {
    // }
    #endregion

    #region 知识点四 垃圾回收机制
    //垃圾回收，英文简写GC(Garbage Collector)
    //垃圾回收的过程是在遍历堆(Heap)上动态分配的所有对象
    //通过识别它们是否被引用来确定哪些对象是垃圾，哪些对象仍要被使用
    //所谓垃圾就是没有被任何变量，对象引用的内容
    //垃圾就需要被回收释放

    //垃圾回收有很多种算法，比如
    //引用计数(Reference Counting)
    //标记清除(Mark Sweep)
    //标记整理(Mark Compact)
    //复制集合(Copy Collection)

    //注意：
    //GC只负责堆(Heap)内存的垃圾回收
    //引用类型都是存在堆(Heap)中的，所以它的分配和释放都通过垃圾回收机制来管理

    //栈(Stack)上的内存都是由系统自动管理
    //值类型在栈(Stack)中分配内存的，它们有自己的生命周期，不用对它们进行管理，会自动分配和释放

    //C#中的回收机制的大概原理
    //0代内存    1代内存   2代内存
    //代的概念：
    //代是垃圾回收机制使用的一种算法（分代算法）
    //新分配的对象都会被配置在0代内存中
    //每次分配都可能会进行垃圾回收以释放内存（0代内存满时）

    //在一次内存回收过程开始时，垃圾回收器会认为堆中全是垃圾，会进行以下两步
    //1.标记对象 从根（静态字段、方法参数） 开始检查引用对象，标记后可达对象，未标记不可达对象（不可达对象就认为是垃圾）
    //2.搬迁对象压缩堆  （挂起执行托管代码线程） 释放未标记对象内存  搬迁可达对象 修改引用地址

    //大对象总认为是第二代内存  目的是减少性能损耗，提高性能
    //不会对大对象进行搬迁 85000字节（约83kb）以上的对象为大对象
    #endregion

    internal class Program
    {
        static void Main(string[] args)
        {
            Person p = new Person("小明", 20);
            Console.WriteLine(p.age);
        }
    }
}
